---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarSystemHookTypeBottomDirn2
source: html/52f8fdb1-47a2-0afa-f2bb-441c728034ba.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarSystemHookTypeBottomDirn2 Property

"Bottom Minor Hook Type"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarSystemHookTypeBottomDirn2 { get; }
```